{
  "attention_bias": false,
  "attention_dropout": 0.0,
  "audio_acoustic_hidden_dim": 64,
  "data_proportion": 0.5,
  "dtype": "bfloat16",
  "encoder_hidden_size": 2048,
  "encoder_intermediate_size": 6144,
  "encoder_num_attention_heads": 16,
  "encoder_num_key_value_heads": 8,
  "fsq_dim": 2048,
  "fsq_input_levels": [
    8,
    8,
    8,
    5,
    5,
    5
  ],
  "fsq_input_num_quantizers": 1,
  "head_dim": 128,
  "hidden_act": "silu",
  "hidden_size": 2560,
  "in_channels": 192,
  "initializer_range": 0.02,
  "intermediate_size": 9728,
  "is_turbo": true,
  "layer_types": [
    "sliding_attention",
    "full_attention",
    "sliding_attention",
    "full_attention",
    "sliding_attention",
    "full_attention",
    "sliding_attention",
    "full_attention",
    "sliding_attention",
    "full_attention",
    "sliding_attention",
    "full_attention",
    "sliding_attention",
    "full_attention",
    "sliding_attention",
    "full_attention",
    "sliding_attention",
    "full_attention",
    "sliding_attention",
    "full_attention",
    "sliding_attention",
    "full_attention",
    "sliding_attention",
    "full_attention",
    "sliding_attention",
    "full_attention",
    "sliding_attention",
    "full_attention",
    "sliding_attention",
    "full_attention",
    "sliding_attention",
    "full_attention"
  ],
  "max_position_embeddings": 32768,
  "model_type": "acestep",
  "model_version": "turbo",
  "num_attention_heads": 32,
  "num_attention_pooler_hidden_layers": 2,
  "num_audio_decoder_hidden_layers": 24,
  "num_hidden_layers": 32,
  "num_key_value_heads": 8,
  "num_lyric_encoder_hidden_layers": 8,
  "num_timbre_encoder_hidden_layers": 4,
  "patch_size": 2,
  "pool_window_size": 5,
  "rms_norm_eps": 1e-06,
  "rope_scaling": null,
  "rope_theta": 1000000,
  "sliding_window": 128,
  "text_hidden_dim": 1024,
  "timbre_fix_frame": 750,
  "timbre_hidden_dim": 64,
  "timestep_mu": -0.4,
  "timestep_sigma": 1.0,
  "transformers_version": "4.57.0",
  "use_cache": true,
  "use_sliding_window": true,
  "vocab_size": 64003,
  "lyric_alignment_layers_config": {
    "3": [18, 27],
    "4": [22],
    "5": [5, 6, 7],
    "6": [2, 12, 13],
    "7": [20, 21]
  }
}
